{"componentChunkName":"component---node-modules-pitayan-gatsby-theme-pitayan-src-templates-post-index-tsx-content-file-path-content-posts-2023-03-13-hunt-for-and-craft-your-own-malicious-usb-index-mdx","path":"/hunting-malicious-usb/","result":{"data":{"mdx":{"body":"\n# Introduction\nUSB drives are essential tools for storing and transferring data, but they can also be used as a weapon in a cyber attack. In this blog post, we will explore a few options attackers can choose to craft a malicious USB drive and the potential consequences of such an attack. \n\n## What is a malicious USB?\nA malicious USB is a USB that looks normal but acts bad. It is capable of typing on an emulated keyboard at the speed of light! USB devices have become an essential part of our daily lives, allowing us to transfer data quickly and easily from one device to another. However, not all USB devices are created equal. Malicious USB devices have become increasingly popular, and the consequences of plugging in an untrusted device can be severe.\n\nA malicious USB device can come in many different shapes and forms. Some are designed to look like ordinary USB drives, while others may be disguised as other devices such as keyboards, mice or books (as the title image). The goal is to lure unsuspecting victims into plugging the device into their computer or come close to an unlocked computer with a hidden USB, giving the attacker access to their system.\n\nOne popular technique used by attackers is to create a device that looks like it contains personal information belonging to someone else. For example, in the TV series Mr. Robot, a character places a USB drive containing a fake resume in a parking lot. When an unsuspecting victim picks up the drive and plugs it into their computer, the attacker gains access to their system.\n\nBut how do these devices work, and why are they so powerful? The answer lies in how computers trust USB devices. To use a computer normally, we need a keyboard to type on or a mouse to navigate. The computer trusts these devices to be legitimate and assumes that anyone with physical access to the computer is authorized to use them. Malicious USB devices take advantage of this trust to gain access to the system. By emulating a keyboard, the device can \"type\" commands into the computer, allowing the attacker to execute code or steal data. Because the device is seen as a legitimate input device, the computer doesn't question its actions, making it an effective tool for attackers.\n\nAlthough some vendors has tried to mitigate this by only allowing certain types of VIDs and PIDs, these are easily spoofable. [Take a look here](https://ducktoolkit.com/vidpid) how easy it may be to change VID and PID for Rubber Ducky. [Here](https://null-byte.wonderhowto.com/how-to/hack-macos-with-digispark-ducky-script-payloads-0198555/) is a bit more job for the Digispark.\n\nTo protect yourself from malicious USB devices, it's important to follow a few simple rules. First and foremost, never plug in an untrusted device or one that you don't know where it came from. Always be wary of USB devices that you find in public places, as they may be designed to trick you into plugging them in.\n\nSecondly, make sure to sign out of your computer when you're done using it. This will help prevent unauthorized access by anyone who gains physical access to the device.\n\n## The basics of crafting a malicious USB drive\n\nThere are several ways to get your hands on a malicious USB, the most popular is by far the Rubber Ducky by Hak5. These are commercially produced and uses a simple and easy to understand language that translates into keyboard presses. Easy to understand, easy to deploy and use.\n\nThe last few years there has been an increase in malicious cables, at least from my observations. The cable acts like a rubber ducky but looks like your normal USB charger cable. \n\nAnother approach is to create one yourself using popular microcontrollers like the Arduino. There are certain requirements for these microcontrollers to emulate a keyboard but aiming for an Arduino Leonardo you are already there in terms of chipset that has this emulation feature (there are dozens of types and sizes, the Leonardo is kinda huge in size).\n\nWay back when I started researching the topics of malicious USB's I made one myself that was able to be used regardless of the OS I wanted to attack. To achieve this, it had a few buttons, 3x2. Where the first row of buttons was for OS (Windows, MacOS and Linux), the next row was for filetypes to extract (text/documents, videos and pictures). Pressing a combination of OS button and filetype button, a command was typed at the speed of inhuman which triggered files files to be sent to a USB storage located in the same hub as the Arduino. I also added a potentiometer to be able to change the delay between each emulated keyboard press. This would enable me to use it on older slower computers as well.\n\n![DIY malicious USB device - fits unnoticed into the bookshelf.](./media/FRONTPIC.jpg)\n\n\nAnd here are a few of the different devices in my collection, for your reference.\n![These devices may take on any shape to get through security and to act normal!](./media/20230315_115058.jpg)\n\n## Let's go hunting\n\nMicrosoft has made it easy to hunt for USBs in Sentinel using KQL. Entering into the ```DeviceEvents``` table, we get access to a lot of information ranging through most of the action types that might lead us to detecting a malicious USB device. Some of which are:\n- PnpDeviceConnected\n- PnPDeviceAllowed\n- UsbDriveMounted\n- UsbDriveUnmounted\n- UsbDriveLetterChanged\n\nBut making it easier doesn't mean it's easy. Attackers always look for ways to hide their steps, and by changing and spoofing the USB PID and VID (Product ID and Vendor ID) they make it harder to be detected. Hunting for these values is by far the most effective way, this also means that there is an additional step in creating such a malicious USB to avoid being detected. I finally resorted into this approach as I tried quite a few different approaches into detecting the few scripts I was running on my device. First of all, I tried to look at the ```UsbDriveMounted``` and set a timegap between that and ```UsbDriveUnmounted``` to look for all process creations and PowerShell commands created during that connection time. But as you may suspect, that proved ineffiecient. It yielded a result not worth my time to dig through. I tried a few variations of this before I saw that I need to filter on known or potentially malicious VIDs and PIDs. And then I found a great resource to go look for such devices based on what kinds of microchip they have (link on top of the query). Not all microchips have the ability to emulate a keyboard - those who do, may be used in these types of attacks. Here is a beginning to list all of these types of devices: \n\n```csharp\n// A great tool to add to this query: https://devicehunt.com/view/type/usb/\nlet known_suspicious = dynamic([\"VID_03eb\", \"PID_2401\"  // Atmel\n                            , \"VID_16D0\", \"PID_0753\"    // Digispark\n                            , \"VID_16C0\", \"PID_0483\"    // Teensyduino\n                            , \"VID_2341\"                // Arduino https://devicehunt.com/view/type/usb/vendor/2341\n                            ]); \nDeviceEvents\n| mv-expand AdditionalFields\n| where AdditionalFields[\"VendorIds\"] has_any (known_suspicious)\n```\nWhat we are doing here, we list known VIDs and PIDs and then do a check on those from the DeviceEvents. Next up we will add ```DeviceProcessEvents``` to look for any processes that **might** be connected and **might** be malicious in nature. This will not show you any parameters of any commands that has been run, but seeing either \"cmd.exe\", \"powershell.exe\" or \"conhost.exe\" should raise some flags as these are, as you know, the gateway to the vault!\n\n\n---\nKeep in mind that all the output of a query are just data. Your job is to make sure you understand and correlate these data with actual wrongdoing! Use your findings to decide whether or not to dig deeper into a device or a user.\n---\n\nMoving on to the complete query:\n```csharp\n// A great tool to add to this query: https://devicehunt.com/view/type/usb/\nlet known_suspicious = dynamic([\"VID_03eb\", \"PID_2401\"  // Atmel\n                            , \"VID_16D0\", \"PID_0753\"    // Digispark\n                            , \"VID_16C0\", \"PID_0483\"    // Teensyduino\n                            , \"VID_2341\"                // Arduino https://devicehunt.com/view/type/usb/vendor/2341\n                            ]); \nDeviceEvents\n| mv-expand AdditionalFields\n| where AdditionalFields[\"VendorIds\"] has_any (known_suspicious)\n| join kind=inner (\n    DeviceProcessEvents\n    | where ProcessCommandLine != \"\"\n    | extend CommandRun = TimeGenerated\n    ) on DeviceId, DeviceName\n| where CommandRun between (TimeGenerated .. 10s) // Time from plugin to action\n| where InitiatingProcessParentFileName1  has_any (\"userinit.exe\", \"explorer.exe\") // User initiated - non system actions\n| project Plugin=TimeGenerated, CommandRun, AdditionalFields, DeviceName, PossibleFileExec=FileName1, InitPCMD = InitiatingProcessCommandLine1, InitPPFN = InitiatingProcessParentFileName1, InitPPID=InitiatingProcessParentId1, PID=ProcessId1\n```\n\nAnother approach or an addition to this approach would be to use this ```DeviceEvents | where ActionType == \"PowerShellCommand\"``` and then filter on a list of known potential malicious PS modules, but for my testing thus far the one provided on top yielded the most accurate answer as cmd and powershell were the ones I initiated through my different USBs as well as opening those application through the startmenu, which is indicated by the explorer.exe.\n\n![Example logs of testing](./media/Screenshot_1.png)\n\n\nConsider this blog entry as a possible way to hunt for these devices. Attackers will always be a step ahead and by combining multiple approaches you might be able to defend pretty well against most types of attacks. By seeking answers only in a few places, you leave yourself and your systems pretty vulnerable. \n\nFeel free to give feedback on this post as well as adding in different PIDs and VIDs you know that are missing.\n\n--- \nLooking for extra resources on learning KQL? Take a look here: [KQLcheat](https://kqlcheat.byfortytwo.com)\n\n\n## Further reading:\n[Jeffrey Appel - Manage device Control with Defender for Endpoint and Endpoint Manager](https://jeffreyappel.nl/manage-device-control-with-microsoft-defender-for-endpoint-and-endpoint-manager-part-1/)\n[In need of a rabbot hole on USB serial numbers?](https://www.sans.org/blog/the-truth-about-usb-device-serial-numbers/)\n[Find the USB history in registry](https://www.cybrary.it/blog/0p3n/usb-forensics-find-the-history-of-every-connected-usb-device-on-your-computer/)\n[USB storage forensics](https://web.archive.org/web/20210126041721/https://forensixchange.com/posts/19_08_03_usb_storage_forensics_1/)\n[Block USB in MS Defender for Endpoint and Intune](https://techcommunity.microsoft.com/t5/manufacturing/block-usb-in-microsoft-defender-for-endpoint-and-intune/ba-p/3040817)\n","timeToRead":8.11,"tableOfContents":{"items":[{"url":"#introduction","title":"Introduction","items":[{"url":"#what-is-a-malicious-usb","title":"What is a malicious USB?"},{"url":"#the-basics-of-crafting-a-malicious-usb-drive","title":"The basics of crafting a malicious USB drive"},{"url":"#lets-go-hunting","title":"Let's go hunting"},{"url":"#keep-in-mind-that-all-the-output-of-a-query-are-just-data-your-job-is-to-make-sure-you-understand-and-correlate-these-data-with-actual-wrongdoing-use-your-findings-to-decide-whether-or-not-to-dig-deeper-into-a-device-or-a-user","title":"Keep in mind that all the output of a query are just data. Your job is to make sure you understand and correlate these data with actual wrongdoing! Use your findings to decide whether or not to dig deeper into a device or a user."},{"url":"#further-reading","title":"Further reading:"}]}]},"frontmatter":{"author":[{"id":"7efe43a5-8dae-5391-b8c0-1c2acebf8c2e","yamlId":"adriankydlandskaftun","name":"Adrian Kydland Skaftun","initial":"AKS","bio":"Cyber security engineer\n","sns":[["linkedin","https://www.linkedin.com/in/akskaftun/"],["github","https://github.com/bittib010"],["mailto","mailto:adrian.skaftun@amesto.no"]],"avatar":{"normal":{"gatsbyImageData":{"layout":"constrained","placeholder":{"fallback":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAVABQDASIAAhEBAxEB/8QAGQABAQADAQAAAAAAAAAAAAAAAAQBAgMF/8QAFgEBAQEAAAAAAAAAAAAAAAAAAQIA/9oADAMBAAIQAxAAAAGrEnUrqkaZtSj0Qb//xAAaEAACAwEBAAAAAAAAAAAAAAABAgAREiED/9oACAEBAAEFAm4FPdkzR1dG57MWfXSwn//EABkRAAEFAAAAAAAAAAAAAAAAAAABAhARIf/aAAgBAwEBPwFqYVP/xAAZEQABBQAAAAAAAAAAAAAAAAAAAQIQESH/2gAIAQIBAT8Bculz/8QAHBAAAgICAwAAAAAAAAAAAAAAAAECEBEhMWFx/9oACAEBAAY/Aq5HKWcd34I3FM//xAAaEAEAAwEBAQAAAAAAAAAAAAABABEhMVFh/9oACAEBAAE/IX85SaewFa7jSAWCIVDLjNIcOCLXAE8mG19Z/9oADAMBAAIAAwAAABCr6MP/xAAYEQADAQEAAAAAAAAAAAAAAAAAAREQIf/aAAgBAwEBPxBa7xWU/8QAFhEBAQEAAAAAAAAAAAAAAAAAAQAR/9oACAECAQE/EFdFuwsL/8QAHBABAQEBAAIDAAAAAAAAAAAAAREAITFRQYGh/9oACAEBAAE/EJqsLHCQxE+nCOK7GZ4MiYL8T93lQih7mnAZzxlqKyDwZ5mGQh3jvvJ4wSvXf//Z"},"images":{"fallback":{"src":"/static/cccbb7c63b7ff3e3ed1d721dbf8a3a2f/fc240/adrian.jpg","srcSet":"/static/cccbb7c63b7ff3e3ed1d721dbf8a3a2f/e26e9/adrian.jpg 32w,\n/static/cccbb7c63b7ff3e3ed1d721dbf8a3a2f/d306e/adrian.jpg 64w,\n/static/cccbb7c63b7ff3e3ed1d721dbf8a3a2f/fc240/adrian.jpg 128w,\n/static/cccbb7c63b7ff3e3ed1d721dbf8a3a2f/e270b/adrian.jpg 256w","sizes":"(min-width: 128px) 128px, 100vw"},"sources":[]},"width":128,"height":136}}}}],"title":"Hunt for Malicious USB's","description":"Hunting for known malicious USB devices.","date":"March 15th, 2023","categories":["usb","malicious","hunt","sentinel","rubber-ducky","arduino","teensyduino"],"hero":{"medium":{"gatsbyImageData":{"layout":"constrained","placeholder":{"fallback":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAALABQDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAAMEAv/EABYBAQEBAAAAAAAAAAAAAAAAAAIAAf/aAAwDAQACEAMQAAABthsyisabf//EABkQAQADAQEAAAAAAAAAAAAAAAEAAhESA//aAAgBAQABBQLoJV9B4taYLg2yf//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQMBAT8BP//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQIBAT8BP//EABsQAAICAwEAAAAAAAAAAAAAAAABAkERIZGB/9oACAEBAAY/AsWybl4jLfDY06L6f//EABsQAQACAwEBAAAAAAAAAAAAAAEAESExUUFx/9oACAEBAAE/IaI8ah9jQJeE6zeY8hxa67KgWaESaR8U/9oADAMBAAIAAwAAABB7D//EABYRAQEBAAAAAAAAAAAAAAAAAAABEf/aAAgBAwEBPxBkf//EABYRAQEBAAAAAAAAAAAAAAAAAAABEf/aAAgBAgEBPxBtf//EABwQAQACAwADAAAAAAAAAAAAAAEAESExUZGhsf/aAAgBAQABPxCyLYfQDBCG5UaPARZa2koCI+0CsIYOFY4McjNEcAfZ/9k="},"images":{"fallback":{"src":"/static/7454c1a169cf18cfe5455a4e44c5d679/0709d/FRONTPIC.jpg","srcSet":"/static/7454c1a169cf18cfe5455a4e44c5d679/50c67/FRONTPIC.jpg 236w,\n/static/7454c1a169cf18cfe5455a4e44c5d679/bd832/FRONTPIC.jpg 472w,\n/static/7454c1a169cf18cfe5455a4e44c5d679/0709d/FRONTPIC.jpg 944w","sizes":"(min-width: 944px) 944px, 100vw"},"sources":[]},"width":944,"height":531}}}},"fields":{"slug":"/hunting-malicious-usb"},"relatedPosts":[{"id":"a9a4e086-4c58-50f9-b7f8-52c23a5467b9","timeToRead":5.035,"fields":{"slug":"/ingess-reverse-proxy"},"frontmatter":{"title":"Simplifying Reverse Proxy Management for external services with Kubernetes Ingress Controller","date":"May 5th, 2023","categories":["Kubernetes","Docker"],"hero":{"normal":{"gatsbyImageData":{"layout":"constrained","placeholder":{"fallback":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAUABQDASIAAhEBAxEB/8QAGAABAAMBAAAAAAAAAAAAAAAAAAEDBAX/xAAWAQEBAQAAAAAAAAAAAAAAAAAEAwL/2gAMAwEAAhADEAAAAc1kWbnhdoVnECSyJW//xAAaEAACAwEBAAAAAAAAAAAAAAABAgADERMx/9oACAEBAAEFAg2qgq5GsxkwUYWLV6WJC+mf/8QAGREAAwADAAAAAAAAAAAAAAAAAAECEBES/9oACAEDAQE/AYW2cojH/8QAGREAAgMBAAAAAAAAAAAAAAAAAAIBEBIh/9oACAECAQE/AW5Bsav/xAAcEAACAgIDAAAAAAAAAAAAAAAAARARAjEiMnH/2gAIAQEABj8CrJDvtC0cpXhs/8QAHBAAAgIDAQEAAAAAAAAAAAAAAAERMUFRYSGB/9oACAEBAAE/IbiPayQiepIo9BbtE9PpiiVN4H+wZzY//9oADAMBAAIAAwAAABAE6H//xAAXEQEBAQEAAAAAAAAAAAAAAAABABAh/9oACAEDAQE/ECorhz//xAAZEQACAwEAAAAAAAAAAAAAAAAAARAhMVH/2gAIAQIBAT8Qa4bcMR//xAAfEAEBAAICAQUAAAAAAAAAAAABEQAxIUFhUXGRsdH/2gAIAQEAAT8QGx1x6dp6/eKHV6a/Mqtc4j6PtMduBoIEKQCw+TnBQcTihvA+lMPGIjULse8KzR5z/9k="},"images":{"fallback":{"src":"/static/ed96061090a400fb2e7e2114abdb8dce/3c367/proxyrobot.jpg","srcSet":"/static/ed96061090a400fb2e7e2114abdb8dce/19e71/proxyrobot.jpg 128w,\n/static/ed96061090a400fb2e7e2114abdb8dce/68974/proxyrobot.jpg 256w,\n/static/ed96061090a400fb2e7e2114abdb8dce/3c367/proxyrobot.jpg 512w","sizes":"(min-width: 512px) 512px, 100vw"},"sources":[]},"width":768,"height":768}}},"description":"Can you actually use the ingress-controller as a reverse proxy for your external services and can you get ssl for a service outside kubernetes as simply as inside?"}},{"id":"2ccf325d-a90c-549f-acd9-4f14ca8bca32","timeToRead":5.015,"fields":{"slug":"/blazor-theme-switcher"},"frontmatter":{"title":"Microsoft Blazor app ThemeSwitcher","date":"April 17th, 2023","categories":["Blazor",".NET"],"hero":{"normal":{"gatsbyImageData":{"layout":"constrained","placeholder":{"fallback":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAALCAYAAAB/Ca1DAAAACXBIWXMAAAsTAAALEwEAmpwYAAACv0lEQVR42l2T+UuTcRzH99dIUbnLEqIwiiLQZWzPs6nYSXZA0EEUSNnlbO55tplp5jFDpcOK+qnDTs2jVS5nVpKZllhemZt5tbRXPN9JRF948/kefN6f6/3VyWY3sknBZshH21vj3WxY6MKywCXs/0hd5MKqdyOZFNITPTiWqtgTFGSzgt2sorObFSSjyuaVZ9m2opQcx0POHwlQdvQFRYeezaNFoPBgC+U5L7hR1EHWqkrSlnlIjssjOc6JZcEZJIOCzp6gIptUstadZ+caP7cruqm//pn2hiHGR6NMRmaZGp8TVjuPDc8w3DfFzQshXtZ3UVPQQG1JMzf9ATISfeis+nxsBgVrfD77UmvofROm5/UYP8Z+Mh6eZqg/zPv2r7QHPtHa0I22ZqOg7LvHfqmC4ztqce2/RfaWS2QuL0C3c30J5XkPqC1pIvS0n/DItHB6/fyziF7tredwRo3o3UXliXgbG5rGn9tI9qbLIpnNKwtF2bJRRbc1qVA4HJAqyc64RuRblKmJKDfKnnHhVB2XzzVS7nyIZFQINvaI7IKP+ml7NMirx1/Ym1KB3eQlfZlPtE5nM7hF9OS4XLYnlREZiTIRmeFqcTMlJ+sozb1PUc5drhQ38XtOK3eO/g8ROloGqMoNUX36LScy72DVu7CbPdqUVRwJXrRe7l7rZ/z7T1HWu2AfV4qfUuV7TNO9zljvfv0mVD9I4PZXXHvq2LWuXCjDYdb8nUJ+uph+PGIoWav9fAyFGeydZLhvmq62b3S+HGagZ5KB3kl6OsKUHgly61wXlacCHE6vZndyEZZFJ7EandiMeTFCrXaNXTK5kQ0+JIMXSe/BYfaRZi5ANniRTV5SF6pUOVsZ/TLD1YKg0J6WjGxyYzU4Bf4hVNmoP03KkmNY5pGyOAbLP3dyglv8KpvxDFZj3l9fyRgj/QPziUncHp9AUAAAAABJRU5ErkJggg=="},"images":{"fallback":{"src":"/static/40d87eb2c1052cf0b51d99e2fb87696b/fa1d9/blazor.png","srcSet":"/static/40d87eb2c1052cf0b51d99e2fb87696b/b034f/blazor.png 192w,\n/static/40d87eb2c1052cf0b51d99e2fb87696b/1809e/blazor.png 384w,\n/static/40d87eb2c1052cf0b51d99e2fb87696b/fa1d9/blazor.png 768w","sizes":"(min-width: 768px) 768px, 100vw"},"sources":[]},"width":768,"height":418}}},"description":"When working on my Blazor portal project, I realized that I needed a way to easily switch between light and dark themes, and to make sure that the user's selection persisted even after a page refresh. To accomplish this, I decided to create a service class that could handle theme switching and storage."}},{"id":"fce26083-3279-5b1c-9b3c-6d052f33a3d5","timeToRead":2.82,"fields":{"slug":"/hvorfor-msp"},"frontmatter":{"title":"Hvorfor tilbyr vi Managed Security Posture som en tjeneste?","date":"March 28th, 2023","categories":["Cyber Security","Security Posture","M365 Defender","Azure AD","Hardening","Proaktiv sikkerhet"],"hero":{"normal":{"gatsbyImageData":{"layout":"constrained","placeholder":{"fallback":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAMCAYAAABiDJ37AAAACXBIWXMAADLAAAAywAEoZFrbAAACOElEQVR42mNgwALq6+uZQPSXly8l1m/akrVs1dqCJctWZ2/Zsi3m/////MhqiAGMIGLjtm1ppU2d73yT8/+HZpde8U7KuxmYXvS/vmvig3379nkTZeiqVauYQfT6TVvSU0rr/0tbuP8VN3H5b+obfUnXPeS6mInzf0Vbn/+FdW2/Du/f7wJS+///f+yG/v//H+yyL69eSdZ0THiu5RL839g74peRd8R/u9CkK0beETdNfKP/m/hE/jT0jvzfMWnGqf///7Mg+wqr6zZu25YcmF78X9cj7K91cMJf86CE//YRKVeNfKJu2Yal/HePy/qr6uj/Pya/8v+ZM2cckfViNXDhstUZvok5N428I06ZB8ScMfGNvOSTlLPaNTZjvZl/7GWroPgzRt6Rp2PzK65v3b3bh6CBS1atKfNPyntn6BVx38wv+qGxT9QLr/isvc7RqQdBbHP/6IcgubCs4nfbt2/3Jmjg3r0HokIyS/4bekf8tQ5J+GsTlvTfLjz5qql/zC3bsOT/ngk5f7VcQ/7HF1b9vnLlvBnOiIFFCiidtU2ccUvDOei/upP/Ly3X4P82IQlXDLzCbup5hv/XcQv5AYqUKXMW7SaYAGE2Hdh7wKu4qeununPQf1BSMfaJvKLlGnRDxNj5v75XxP+m3skvr54/r01UWoQpOH38tEPnxBkXYvMr/8cX1V5JKK69mVRc+3/yzPl7b125ooXsK2JcCvM+y9UzF223bt3puWvv3qAbNy6boqtBBwDrFCdQujxAKwAAAABJRU5ErkJggg=="},"images":{"fallback":{"src":"/static/4619c94bb1148f03b190e970a2e607e4/e1368/msp-loop.png","srcSet":"/static/4619c94bb1148f03b190e970a2e607e4/6b9ea/msp-loop.png 192w,\n/static/4619c94bb1148f03b190e970a2e607e4/d8939/msp-loop.png 384w,\n/static/4619c94bb1148f03b190e970a2e607e4/e1368/msp-loop.png 768w","sizes":"(min-width: 768px) 768px, 100vw"},"sources":[]},"width":768,"height":457}}},"description":"Del 3 i serien om konfigurasjonskontroll, som metode for å øke motstandsdyktigheten i skyløsninger, handler om endringer knyttet til autentiseringsmetoder og tilhørende funksjoner i Azure AD."}}]}},"pageContext":{"slug":"/hunting-malicious-usb","tableOfContentsLevels":2,"previous":{"title":"Microsoft Defender Suite - Comprehensive Cybersecurity for Today's Digital Landscape","slug":"/microsoft-defender-suite-comprehensive-cybersecurity"},"next":{"title":"Bulk triage IPs with python and alienvault","slug":"/bulk-triage-ips"},"frontmatter":{"title":"Hunt for Malicious USB's","author":["Adrian Kydland Skaftun"],"date":"2023-03-15T00:00:00.000Z","categories":["usb","malicious","hunt","sentinel","rubber-ducky","arduino","teensyduino"],"description":"Hunting for known malicious USB devices.","hero":"media/FRONTPIC.jpg","slug":"hunting-malicious-usb"}}},"staticQueryHashes":["176088207"],"slicesMap":{}}