{"componentChunkName":"component---node-modules-pitayan-gatsby-theme-pitayan-src-templates-post-index-tsx-content-file-path-content-posts-2022-09-01-hunt-for-phishing-lnk-file-index-mdx","path":"/webbrowser-phishing-lnk-file/","result":{"data":{"mdx":{"body":"\n\n# Webbrowser based phishing technique\n\n\nPhishing is one of the most dangerous and ugliest types of attacks out there, because it is based on human interaction, naiveness and error. The only reason for a computer to fail is because someone told it to - meaning errors in code or other related human misconfigurations. MFA fatigue is one ongoing way of exploiting human \"weakness\" as Kjetil mentioned in his blogpost relating to the Uber breach. I'm going to highlight another,  new technique demonstrated by [mr.d0x](https://mrd0x.com/phishing-with-chromium-application-mode/). And we will dive into some KQL to help you investigate this kind of attack further by hunting for the obvious relating to it.\n\n## Phishing technique walkthrough\nThis technique uses Chromium based browsers like Google Chrome or MSEdge as a Desktop applications with local malicious login forms disguised as a trustworthy app. It all takes the form of a shortcut file, lnk, with a tiny script.\n\nWhat makes this phishing technique stealthy is that it hides it self in appearance of a regular Desktop app. Once you open the app it launches a webbrowser in app-mode, which does not have the addressbar at the top - meaning that you have one less way of approving that the site you are directed to is legitimate. You can easily design a fake address bar as well as the logo for the application, hiding everything obvious that resembles an lnk file, just like mr.d0x did in the article above.\n\n### What is an lnk file?\nThe name kinda gives it away - it links to another file. Normally refered to as a shortcut. The actual file is stored somewhere else, and a shortcut file only points to where the data is stored. What is also worth mentioning about these files is that their extension is not showing, even if you have enabled windows to show extensions.\n\n![](media/20221014152629.png)  \n\nThis also lets us masquerade the file as whatever we want. The shortcut symbol may give it away, but this may be replaced by another symbol if you have it in a OneDrive synced folder for instance. \n\nThe appmode mentioned belongs to Chromium browsers, which is an open source project that a lot of todays modern browsers are based upon. \n\nLets create the payload as shown in the screenshot:  \n![](media/20221014154415.png)  \n\nPaste this snippet into the \"Target\" field within the shortcut files properties if you are changing a shorcut already made. If you are creating a new one, paste it into the window that appears through the wizard.\n\n    \"C:\\Program Files (x86)\\Microsoft\\Edge\\Application\\msedge.exe\" --app=https://www.amestofortytwo.com/\n\nHere is what the output looks like once you open the file:\n![](media/20221014154259.png)  \nNote the minimalistic web browser view, no address bar, jpg icon, pdf extension. Also - another thing that makes it harder to spot is that Windows Taskbar displays the favicon of the webpage, not the browser icon.\n\nNote! This is not a well thought-through attack I'm showing (with jpg icon and pdf extension), it just shows some possibilities.\n\n\n### KQL-query to go hunt for this activity\nArmed with some knowledge on how this exploit works, it's time to go hunt for it. We know that it runs a command when opened - well, lets look for it. We also know what the command might contain (like browsers), and that it uses appmode (\"--app\"), it might reach out to the wide web (\"http\"). Lets limit this to use with only lnk files as well. Use this query as a starting place to dig deeper into your logs. \n\n    DeviceFileEvents\n    | where InitiatingProcessFileName has_any (\"msedge\", \"chrome\")\n    | where InitiatingProcessCommandLine has_any (\"--app\", \"http\")\n    | where FileName endswith \"lnk\"\n    | project\n        TimeGenerated,\n        DeviceName,\n        FileName,\n        FolderPath,\n        InitiatingProcessFolderPath,\n        InitiatingProcessAccountName,\n        InitiatingProcessCommandLine,\n        PreviousFileName,\n        MD5,\n        SHA1,\n        SHA256\n        \nThe above query does not give you any answers, it just looks at indicators known to belong to this attack. It's up to you to investigate the maliciousness of the query output. Correlating between known indicators (file-hashes, IPs...), tactics and behavior will take you far.\n\nA wider search option would be to search for related artefacts of this attack by this query (feel free to change what's inside the quotes or even the tables). This query searches through all tables that starts with \"Device\" where \"--app\" is present:\n\n    search in (Device*) \"--app\"\n\n\nYou can do a search for files in the aggregated table \"imFileEvent\" and see if there is a mismatch between the extension of the filename and the actual filetype. Doing this I also learned that the actual file type is appended to the filename by Sentinel, which means that there will be two file extensions when viewing the logs, if the mentioned technique is being applied. Try finding this by:\n\n    let knownFileExts = dynamic([\"pdf\", \"jpg\", \"txt\", \"bin\", \"exe\"]);\n    imFileEvent\n    | where SourceFileExtension == \"lnk\"\n    | extend splittedFNExt = split(SourceFileName, \".\")\n    | where splittedFNExt[-2] in (knownFileExts)\n\nWe are creating a dynamic variable type which we populate with a list of known fileextensions(nowhere complete). And then we limit the result from imFileEvent on the fileextension \"lnk\" (which we know is added inside the logs) before we split the filename, to compare the possible double fileextension based on the list of fileextensions.\n\nHere is a wider, yet powerfull search. Tune it to your need. This looks through every table that starts with \"Device\" and where any rows has \"--app\". Before we shorten it down even more with \"lnk\" in FileName.\n\n    search in (Device*) \"--app\"\n    | where FileName has \"lnk\"\n\nAnother approach will be to first look for lnk files that have been downloaded, maybe coming from an email attachment in a phishing mail. Then use the filename of the downloaded lnk file for further investigation through any of the tables we have hightlighted in the query examples provided. \n\n## How do I protect myself?\nOne case of protection is to investigate, but that is an \"after the fact\" protection,  to stay up front in case of an attack Microsoft has a great way of protecting you if you enable Web Protection in Defender for endpoint. To quote MS: \"Web threat protection stops access to phishing sites, malware vectors, exploit sites, untrusted or low-reputation sites, as well as sites that you have blocked in your custom indicator list.\"\n\nRead more about Microsofts Web protection in Defender for Enpoint [here](https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/web-threat-protection?view=o365-worldwide)\n\nIf you have any suggestions for improvement of this article, please let me know!\n\n### Resources\nhttps://learn.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-devicefileevents-table?view=o365-worldwide  \nhttps://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/web-threat-protection?view=o365-worldwide  \nhttps://mrd0x.com/phishing-with-chromium-application-mode/","timeToRead":5.28,"tableOfContents":{"items":[{"url":"#webbrowser-based-phishing-technique","title":"Webbrowser based phishing technique","items":[{"url":"#phishing-technique-walkthrough","title":"Phishing technique walkthrough","items":[{"url":"#what-is-an-lnk-file","title":"What is an lnk file?"},{"url":"#kql-query-to-go-hunt-for-this-activity","title":"KQL-query to go hunt for this activity"}]},{"url":"#how-do-i-protect-myself","title":"How do I protect myself?","items":[{"url":"#resources","title":"Resources"}]}]}]},"frontmatter":{"author":[{"id":"7efe43a5-8dae-5391-b8c0-1c2acebf8c2e","yamlId":"adriankydlandskaftun","name":"Adrian Kydland Skaftun","initial":"AKS","bio":"Cyber security engineer\n","sns":[["linkedin","https://www.linkedin.com/in/akskaftun/"],["github","https://github.com/bittib010"],["mailto","mailto:adrian.skaftun@amesto.no"]],"avatar":{"normal":{"gatsbyImageData":{"layout":"constrained","placeholder":{"fallback":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAVABQDASIAAhEBAxEB/8QAGQABAQADAQAAAAAAAAAAAAAAAAQBAgMF/8QAFgEBAQEAAAAAAAAAAAAAAAAAAQIA/9oADAMBAAIQAxAAAAGrEnUrqkaZtSj0Qb//xAAaEAACAwEBAAAAAAAAAAAAAAABAgAREiED/9oACAEBAAEFAm4FPdkzR1dG57MWfXSwn//EABkRAAEFAAAAAAAAAAAAAAAAAAABAhARIf/aAAgBAwEBPwFqYVP/xAAZEQABBQAAAAAAAAAAAAAAAAAAAQIQESH/2gAIAQIBAT8Bculz/8QAHBAAAgICAwAAAAAAAAAAAAAAAAECEBEhMWFx/9oACAEBAAY/Aq5HKWcd34I3FM//xAAaEAEAAwEBAQAAAAAAAAAAAAABABEhMVFh/9oACAEBAAE/IX85SaewFa7jSAWCIVDLjNIcOCLXAE8mG19Z/9oADAMBAAIAAwAAABCr6MP/xAAYEQADAQEAAAAAAAAAAAAAAAAAAREQIf/aAAgBAwEBPxBa7xWU/8QAFhEBAQEAAAAAAAAAAAAAAAAAAQAR/9oACAECAQE/EFdFuwsL/8QAHBABAQEBAAIDAAAAAAAAAAAAAREAITFRQYGh/9oACAEBAAE/EJqsLHCQxE+nCOK7GZ4MiYL8T93lQih7mnAZzxlqKyDwZ5mGQh3jvvJ4wSvXf//Z"},"images":{"fallback":{"src":"/static/cccbb7c63b7ff3e3ed1d721dbf8a3a2f/fc240/adrian.jpg","srcSet":"/static/cccbb7c63b7ff3e3ed1d721dbf8a3a2f/e26e9/adrian.jpg 32w,\n/static/cccbb7c63b7ff3e3ed1d721dbf8a3a2f/d306e/adrian.jpg 64w,\n/static/cccbb7c63b7ff3e3ed1d721dbf8a3a2f/fc240/adrian.jpg 128w,\n/static/cccbb7c63b7ff3e3ed1d721dbf8a3a2f/e270b/adrian.jpg 256w","sizes":"(min-width: 128px) 128px, 100vw"},"sources":[]},"width":128,"height":136}}}}],"title":"Webbrowser based phishing technique","description":"A high overview of the recently discovered phishing technique, and how to hunt for it.","date":"October 1st, 2022","categories":["KQL","Azure Sentinel","Kusto"],"hero":{"medium":{"gatsbyImageData":{"layout":"constrained","placeholder":{"fallback":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAALCAYAAAB/Ca1DAAAACXBIWXMAAAsTAAALEwEAmpwYAAADC0lEQVR42i2SW0+bBQCGv1/ghRNQRnbvhYc5gzNGdAq0EKeIEygtA2vb72u/0tJuQyeTUAZtIdOZJRoB45jZJroturluodDSw1jDoQI9F23YIQwY6LLFxGTOPYbOiyfv+9y8V6+g9cYwjMeRJtKIo3NIl6OYJzIYvXHEwCLy0CkMFyYRAxkkfwKjP4UpmMR8JYUcTub7JnIggWkiiSD6kphDi4ij87zW7uRVayeSZwZTIItxPI5l8Dj6y1GkYBY5lKE1nMV8JYscfuSbaf4fYyCNIAfSmPwJ3jJZeGP325TWNvLyfifGySUs31+g9eRPGHwJRH8ctS+ByhtDPRZDMx5HMxanMe/xvBtDGQTr1RzvDp1HW/kiU+88xsXaEo6WF7N36Ay2735EujiNHE6gdn+Bq+k9epv34Gh5H7dOhVvXiKOlDpe2nkPqGtQDPyDIwQz6S1Fq7B8xWPs0pxqeo0/1Ck1fn2bf8AiiL4UhcoPmrm6Wq7dxX1HMg6qnuFNZzF3FVh5UF0J1IbfeLKSh70sEoz+JJbKE7tIsLzRJ7FTrqP95BvMvYWzfnMAQyiFFlmh2uNlQlnCnahsoijiireKwtZaHygKoKuJmeTGqIwMIplAWnWeGXaYD7NDaeF7fTpmlA8PHnbQNn8MQXESKXKOlu5+/lFv5V/kkDyuL0LjsKI52QGUBKItYriyh8bNBBHkyR03/IKV7NJTq29nR3Iqi83P0DifiWR/6zTtFrlN30MH6ri38U/EE9yseJ1r3DBHVdv4uL8iP5sq2UNN7DME6eZ3OYy4aTCLbVSLP7q5H9dUI7eE0tmAGe/h32qZu4jrr4VyHmW/bPmTYrue03MSIeS8n7AaOW7WcOdRKz3kfQu/CHzj8cTR9A7z0gYUy8ye8bvmUntifOH69TdfsKo7oKrNr95i+tow3mcOfyuGZS+fxpXKMJX4jemOFqdW7CL3xe7hGryIftLFTt4/9nmkqDvQgnfTSPb9B1+xKfrAnuoJzfg33wu08fbEN+mPrj/rCOs65NQ5Hb/EfV0dQeXOwCz4AAAAASUVORK5CYII="},"images":{"fallback":{"src":"/static/6412d10897d06e58fa8c7fa672d6de12/14868/dall-e-hacker.png","srcSet":"/static/6412d10897d06e58fa8c7fa672d6de12/9280c/dall-e-hacker.png 236w,\n/static/6412d10897d06e58fa8c7fa672d6de12/9819a/dall-e-hacker.png 472w,\n/static/6412d10897d06e58fa8c7fa672d6de12/14868/dall-e-hacker.png 944w,\n/static/6412d10897d06e58fa8c7fa672d6de12/313d6/dall-e-hacker.png 1888w","sizes":"(min-width: 944px) 944px, 100vw"},"sources":[]},"width":944,"height":531}}}},"fields":{"slug":"/webbrowser-phishing-lnk-file"},"relatedPosts":[{"id":"e66a3da6-740b-526e-8106-62a9d1ff1f92","timeToRead":0.99,"fields":{"slug":"/kqlcheat"},"frontmatter":{"title":"Interactive KQL Cheatsheet","date":"February 9th, 2023","categories":["KQL","Cheatsheet","Introductory","Query lessons"],"hero":{"normal":{"gatsbyImageData":{"layout":"constrained","placeholder":{"fallback":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAJCAYAAAAywQxIAAAACXBIWXMAAAsTAAALEwEAmpwYAAACoElEQVR42gXBe0zMAQDA8d8fmL+saTPGH9kyjZoTppQ1hZQk0rt2ucplpHNTV5fWU3o4dS7JzZzUXEcPR9dDlx5aL1bmeri1RGupvBbjsObr8xFsb1fxbzkMXf5+4pwEtm5ci3inAwOBdlijNzPXlssyD1mcUjBnKeHXUju2r4/4bXuObf4JC1YVE2P1/PgyStGFMISfoyuB4ww/i6Xy6Gridq+jJWgPBrcNpEgymByo4O9iEd/nNVh7zjHeLueTpRTbkpE/P1v4Maelv7+aob468s6FIvybtqPf6Edd2R2GixMxHhfoUiZSI5MQ4qckQ1bOjEXFd2s2n8cLeNcjx9qhZGrkNv3NaqbGdDS3aXlQnIQuS4IwO+aM/JQ/koDL6EvaKfBdzynvbei09/EU+XDMI5fbFQUsfchjsEHMUIMYi1mOpVPNgtmEviCLmJBwvr3qZvppDUKm0p+b8VKk/mkoJPeQHlbj5+jOjasPCT6gJf+ojLvZ8Xwd1fDxTSEvtaGMaI4wYb7OQm8nmqSziI958+vNEMNVlQhBvm40ZmQjiyrlkKuMCxEmYvZV47lLTnRgNpOPQhlXB2BI8KJVFUVHjD2ZW1ZgkB5k0FBFmIcXl+JjWXo9wpMruQg+e0Wo4uSkJ9wlNkhLRHgV4QGDiIMTmKrexHyFC7MaMcZId+Jc1lDssZIisTvXpUF0N2rJu6xAVZjH75n3VMrSEVy3ONJe2sD9slHORFQjcpWRfvEFtSUlNCc7kLLXDqWfF6kiNxJOnKbTVM5Il5q+pnwsDcn06lO5stGZJnEwyYG+CK7bd1J71cT5GD0nfXPw9onmWo4edycfQvwjKC9VkaZIpFZxnlbdLczmenp7TDQ/LsPUWohBEonR3ps7O0KI3CDiP1DV1TY0dntuAAAAAElFTkSuQmCC"},"images":{"fallback":{"src":"/static/c06c02a3f8f457b430795fc39bd2ed2f/52ecd/dalle.png","srcSet":"/static/c06c02a3f8f457b430795fc39bd2ed2f/4c508/dalle.png 192w,\n/static/c06c02a3f8f457b430795fc39bd2ed2f/0612f/dalle.png 384w,\n/static/c06c02a3f8f457b430795fc39bd2ed2f/52ecd/dalle.png 768w,\n/static/c06c02a3f8f457b430795fc39bd2ed2f/b54a9/dalle.png 1536w","sizes":"(min-width: 768px) 768px, 100vw"},"sources":[]},"width":768,"height":361}}},"description":"Introducing a new open source tool"}},{"id":"8ec61554-dff6-5a9c-9845-3eb83e41213b","timeToRead":11.375,"fields":{"slug":"/kusto-detective-agency6"},"frontmatter":{"title":"Kusto Detective - Senior Detective - Big Heist","date":"December 11th, 2022","categories":["KQL","Azure Data Explorer","Data Science"],"hero":{"normal":{"gatsbyImageData":{"layout":"constrained","placeholder":{"fallback":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAUCAYAAACNiR0NAAAACXBIWXMAAAsTAAALEwEAmpwYAAAE3klEQVR42mWUa0yTVxjHD7qhGVu2qUihXHpv3/ft+/a8raWlUEoR5F4opdxsBwgUhAECip1ICszp4nRym9F4dxOnMWQz7pZlF5csc2Z+WLI4P2zJEvd1i4lfTOjb/wICDvknJ+fkOef5nUvO8yfkmeII8a9PSgokkDVq2khIZOPz0cRE/8vE71+/dj15GkzVFLjy82wPOD63ixBPCiGVr5HX3Y4d+dlflRZZvyEbq3II6XuNkJ3JBt7dnueyP1Ay2wuWIMvgyLqnfZ2uuYH+9eNsBs6Mc9KBDvPjoZbMfw6FHPMXhpy4eVqGE6OK6IEe5t/hPubxzLhB+uycDoFa698kvphdzSKhLdUeyy/fXklBQR4XLS8wSuE2HvubRbR7LTEqmKVMKy/taVPFIv1KhLs0qCjmYrnZfPTqJIfKMvuvhFQkLcGur8/Ns319+0YiqsoM0eR0MxQaESkZInwVHGorWXQ1MWj08thVz8NTJCBdaYZCLSJVQVHo5qMfT/Fw5Tq+JyQSv4i02h3nb12Uocajl9KUZugZE1iOosgtYLuLR0khC4edh9vJo7TQCK1OhFJLka6iKCngpXNHediysj8iBHFLp/x8w85aeufaSTnSlVTieREarQiBCgh3qTE9aEZbjQmeUhZaA4XXY4C/TIBKa5Kmxoxo8GXeIyTy0iLK5XK9sNCLltyBq1NKFOVz0YGgiAavEX0hHe5+uhk/TFlx74oK12bSUV1uxOH9GhweYNDoY+cnR02wZTnDK6xloCUzp//yCSVa65josUEOJ99W4s1WPS5NyHBqbyaO9AroatWhsljAYBuHwQ4WdVXGtcCnQlygznx7djoVWj2NluRRdDcZ4C1ncOfGVty/bMbBdhPa39CjyWdETzODXQ0cktKoNDNmRL3P9hMhePbBX9la5jl7LANdzeqYLNUCeYaI5PSFRsEaTShwmlC6XYAtU4DVyqMjwGCojYWBMaG+yhh7f4RCpsyvWQFWey3X584nQaOjUa3BBF+lDrubdNjXwmOs3Yqz78px80wqRvsZbJaZsVUuwmqhyMsRkKak0VPv8PB67J8sXzd+eK/+96MROWTybVJ5EYe7XyZgdiYF08MMrkVsmDuhxfQhOXpaWDRU8wj6edhtJlgtJmSoqLSv04j+kOXPpXpH/Mg+3f3xcCpy7KL0xSkNXLnc4l9cuOLZt8z4YIji+KgcM2NqXD7O4OcbBhzsNWJuQoPsLF7qa+Ux0LntjxUDaWygc1dPy6BUi1FnlgCdgUKtFWHPMqLRx6HNR7G7RYOgn0V2lgmUmiAIFE6HAIWaRicjPOp89lsrb5is2tF4aVKB/d2K+U0yi5SiECFLM2ObjUWw1oD2GoqOoA4VJRw0OjOSUs1YKNEtyaIUCnDzk6NmqPTullUGlpObdfHDCTXOH1FL4RCLngC/eLISlxhTaGgsQy3GyosNsY6gFr27dNjbocfECCNNj4twOh1X/ld2yzr9otbgDrUFxO+Gu00PD3ZaHo12Wp9M9GVjpjcnNjshi104lobDYe2TkT3so3C38LC53nKb4Vy7V0zhOS3tgHWEDCYQUpxI4vPZzWpXVbDK8Vt7gD7YJN/hI8TPEuJPJOS9hAWnWp27RosGuTKJpfGr6YXKDYlV6sUYViXHRSIrprqo/wBA2R1e7L/h2gAAAABJRU5ErkJggg=="},"images":{"fallback":{"src":"/static/d9e052cdd999968c22f9126d306f8d79/c7240/badge.png","srcSet":"/static/d9e052cdd999968c22f9126d306f8d79/de3a1/badge.png 150w,\n/static/d9e052cdd999968c22f9126d306f8d79/30cdc/badge.png 300w,\n/static/d9e052cdd999968c22f9126d306f8d79/c7240/badge.png 600w","sizes":"(min-width: 600px) 600px, 100vw"},"sources":[]},"width":768,"height":768}}},"description":"Walkthrough of Kusto Detective Agency series"}},{"id":"fadcd6fc-3674-5580-9a67-1010e6f5824e","timeToRead":9.305,"fields":{"slug":"/kusto-detective-agency5"},"frontmatter":{"title":"Kusto Detective - Detective 3 - Ready to play?","date":"December 10th, 2022","categories":["KQL","Azure Data Explorer","Data Science"],"hero":{"normal":{"gatsbyImageData":{"layout":"constrained","placeholder":{"fallback":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAUCAYAAACNiR0NAAAACXBIWXMAAAsTAAALEwEAmpwYAAAE3ElEQVR42m2Ua0xTZxjHj5c5sy26bFawcm1pabmKIFAubRm1Fgot0Bu0FaxtaWuxpbJysUB10kHljhUQC8JgXpg6RUnmLnF+WGYW/WCybCTbki3u6xYTv5jQ0//SIqy6/ZOT9+Q5z/vLed7nff4E8a82EYRiS1RUxtvEf7X95fOKKJSUdwiFYsv/5BPhYEJSGo/LL19hpeYcIwiCShDEuwSxvUBwqPqeSCz7ZuvW7UVrMWIPK2W/kVcqXmEw0gWRjJA2ry3bmPJa/e9XbnyBEZ+f7Ojsee7qOvPXmG9ydW7hOhavL2FgyBdo7Tj1d7vrzPNRn5+8vXwfmgbznwRBpLzKIohdIrHi0eTMIrj8skBZhYxs7TiFLrcHx+3OYFZ2IZmTyyWbbM6gq9sDZ5sbFVJlsJgvCixcW4KkWvOEIIiojXILioVfjfsXIRBVB2LjmUigpYAakwRpjRrSGg2M5mYo63Q4fMSC8koF4hJY4ZyYOCYEh6SBT64sgVtS/m2ozDAxO5c7MzB2CYfK5WQokcnOAjstBwKhBCWlYpQelCA3n49ivggHRVVgsvYhkZ4aBovEMnJy+gryOB8srDV2TW9Wyesf9g1OIYHGJjP25YPBzEBaRh50jQ74JqZhNNshlijDMGG5DDUKLehJaeSIbwa1WsNjgiDeCpN4PN7W0JqVXXSib/AC+KXigLOtC3UaPfQmB2YWlvDdw8f44dETzM5fh1iiQpvLA0/vIFRq3erwuWnkcUraN1jrwOx8nqPHex4qjSHgHRjD2Hk/jhhs6PxoGHPzV+HtH4XR4kCFVAWbowPW5g7IlA2rw74QUNAe+XPhS10lO/zA0z8BRnJmQFwph8XagrIKBfzzt7Dyyx9wn+7FEb0VKvVRGEzN0DaYEU2lkSO+S1DV6b+PvIcElZog6Tw9BKXaGIyJYyAmlomYWEa406yU/RAIK1EmliGXU4LMrAJo6k1oae1EMjsLyrqjQe/QJKL3Jso3gGUVqkXvsB9JzIwAIzkzfOi12kY0t7jgPTuC8ckZLN5YxsnuXlCi4hBNTUROLhdcvijU6cDYxBykNdpb67xtBsuHP9tauhAbzySFZdWYmr2JUPm9/edwZ/kebn6+jMHhcViOOyGv1UFRp8eB/BIcyOMhPpFFOpzdaLKf/G193rc1Wtt+arS2orBYSN6++zU4RQfD1yM7l4vZ+Wu4OD2PvrMjGBq9gMnpq7jz5UM0O0/h6mdL4BSWklZbO2yOzl83DEQq097s8Y6DzkgPFHGFSGbvC5WPnDweahT1aDTZYD7mgFprBKdQgMwsDtIz81HEE4YmJtA/MgVlnf7uxhnSaOlqt2cMOqN9dXd0PLk3loE9VDrSMjmoktfDZLHDaLJBXKkEnZERPsNQw3btjiMNZsfqwOhF0JLSdK/4F6dAMOs5O4G+wQnSfsKFJrsT5mPNkFSpgon01GACjR0UV8qDBpMNVpsTjg87MTQ6RY6evxQayU8jx25db7BS9jeq6833Tzi7n7q6ep593Df0YnbuMsYvzAVnZi8Hp/zzOOMZeHGyq+eZs/300wa99QE7NduyYQqvaVOEp4VcmxLyuZ3vx1RpGkw/6gxNK+9R4mQvvY/yMmfLa3tfl3tz5EcA4fedO6MSd+yg0CNj6yC32705EvEPSM9LPBx/XPAAAAAASUVORK5CYII="},"images":{"fallback":{"src":"/static/f1c33454376cde2d699413464544ebbd/c7240/badge.png","srcSet":"/static/f1c33454376cde2d699413464544ebbd/de3a1/badge.png 150w,\n/static/f1c33454376cde2d699413464544ebbd/30cdc/badge.png 300w,\n/static/f1c33454376cde2d699413464544ebbd/c7240/badge.png 600w","sizes":"(min-width: 600px) 600px, 100vw"},"sources":[]},"width":768,"height":768}}},"description":"Walkthrough of Kusto Detective Agency series"}}]}},"pageContext":{"slug":"/webbrowser-phishing-lnk-file","tableOfContentsLevels":2,"previous":{"title":"TechTalk - Post-pandemic way of work","slug":"/techtalk-post-pandemic-wow"},"next":{"title":"Du er ikke så spesiell som du tror","slug":"/du-er-ikke-saa-spesiell"},"frontmatter":{"title":"Webbrowser based phishing technique","author":["Adrian Kydland Skaftun"],"date":"2022-10-01T00:00:00.000Z","categories":["KQL","Azure Sentinel","Kusto"],"description":"A high overview of the recently discovered phishing technique, and how to hunt for it.","hero":"media/dall-e-hacker.png","slug":"webbrowser-phishing-lnk-file"}}},"staticQueryHashes":["176088207"],"slicesMap":{}}